Repository: vakesz/Glasstual
Catalog: Sources/App/Features/ChannelProperties/ChannelProperties.xcstrings
Source language: en
Languages: de, hu

source: General event messages
de: Allgemeine Ereignismeldungen
hu: Általános eseményüzenetek

# general-event-messages-show
source: Show
de: Anzeigen
hu: Megjelenítés

# general-event-messages-collapse
source: Collapse
de: Zusammenklappen
hu: Összecsukás

# general-event-messages-hide
source: Hide
de: Ausblenden
hu: Elrejtés

# general-event-messages-help
source: Collapse groups consecutive channel events so you can expand them when needed.
de: Zusammenklappen fasst aufeinanderfolgende Kanalereignisse zusammen, die du bei Bedarf aufklappen kannst.
hu: Az összecsukás csoportosítja az egymást követő csatornaeseményeket, hogy szükség esetén kinyithasd őket.

# change-modes-button
source: Change Modes
de: Modi ändern
hu: Módok módosítása

# channel-key-characters-over-limit
source: %lld bytes too many
de: %lld Byte zu viel
hu: %lld bájttal több

# channel-key-field-hint
source: Enter the channel key used by members when joining.
de: Gib den Kanalschlüssel ein, den Mitglieder beim Beitritt verwenden.
hu: Add meg a csatornakulcsot, amelyet a tagok csatlakozáskor használnak.

# channel-key-mode
source: Channel key (+k)
de: Kanalschlüssel (+k)
hu: Csatornakulcs (+k)

# channel-key-placeholder
source: Channel key
de: Kanalschlüssel
hu: Csatornakulcs

# channel-picker-label
source: Channel
de: Kanal
hu: Csatorna

# channel-properties-window-title
source: Channel Properties
de: Kanaleigenschaften
hu: Csatorna tulajdonságai

source: Defaults
de: Standardwerte
hu: Alapértékek

# defaults-help
source: Applied when you are the first person to join the channel.
de: Werden angewendet, wenn du als erste Person dem Kanal beitrittst.
hu: Akkor lépnek életbe, ha elsőként csatlakozol a csatornához.

source: Disable general event messages
de: Allgemeine Ereignismeldungen deaktivieren
hu: Általános eseményüzenetek letiltása

source: Disable highlights
de: Hervorhebungen deaktivieren
hu: Említések letiltása

source: Disable inline media
de: Eingebettete Medien deaktivieren
hu: Beágyazott média letiltása

source: General
de: Allgemein
hu: Általános

# heading
source: Modes for %@
de: Modi für %@
hu: %@ módjai

# heading-above-the-channel-invite
source: Invite %@
de: %@ einladen
hu: %@ meghívása

# invite-button
source: Invite
de: Einladen
hu: Meghívás

# invite-only-mode
source: Invite-only channel (+i)
de: Beitritt nur auf Einladung (+i)
hu: Csak meghívással elérhető csatorna (+i)

# invitee-count
source: %ld users
de: %ld Benutzer
hu: %ld felhasználó

source: Join on connect
de: Beim Verbinden beitreten
hu: Csatlakozás kapcsolódáskor

# joins-exactly-two-nicknames
source: %1$@ and %2$@
de: %1$@ und %2$@
hu: %1$@ és %2$@

# label-help
source: When you give a channel a label, that label will appear in the Server List in lieu of the channel name.
de: Wenn du einem Kanal eine Beschriftung gibst, erscheint sie in der Serverliste anstelle des Kanalnamens.
hu: Ha címkét adsz egy csatornának, a kiszolgálólistában ez jelenik meg a csatorna neve helyett.

# label-label
source: Label
de: Beschriftung
hu: Címke

# moderated-mode
source: Moderated channel (+m)
de: Moderierter Kanal (+m)
hu: Moderált csatorna (+m)

# modes-label
source: Modes
de: Modi
hu: Módok

source: Mute this conversation
de: Diese Unterhaltung stummschalten
hu: Beszélgetés némítása

# no-external-messages-mode
source: No external channel messages (+n)
de: Keine externen Kanalnachrichten (+n)
hu: Külső csatornaüzenetek tiltása (+n)

# operator-topic-mode
source: Only operators can change topic (+t)
de: Nur Operatoren dürfen das Thema ändern (+t)
hu: Csak operátorok módosíthatják a témát (+t)

# password-help
source: The channel’s key, sent when joining. Stored in your keychain.
de: Der beim Beitritt gesendete Kanalschlüssel. Wird in deinem Schlüsselbund gespeichert.
hu: A csatlakozáskor elküldött csatornakulcs. A kulcskarikában tároljuk.

# password-label
source: Password
de: Passwort
hu: Jelszó

# please-enter-a-properly-formatted-channel
source: Enter a channel name beginning with a channel prefix, such as #example.
de: Gib einen Kanalnamen mit Kanalpräfix ein, zum Beispiel #example.
hu: Adj meg csatornaelőtaggal kezdődő nevet, például #example.

# private-channel-mode
source: Private channel (+p)
de: Privater Kanal (+p)
hu: Privát csatorna (+p)

# reload-button
source: Reload
de: Neu laden
hu: Újratöltés

# secret-channel-mode
source: Secret channel (+s)
de: Geheimer Kanal (+s)
hu: Titkos csatorna (+s)

# secret-key-length
source: %1$ld of %2$ld bytes
de: %1$ld von %2$ld Byte
hu: %1$ld / %2$ld bájt

# secret-key-too-long
source: %1$@ accepts at most %2$ld bytes. Anything past that may be cut off.
de: %1$@ akzeptiert höchstens %2$ld Byte. Alles darüber hinaus kann abgeschnitten werden.
hu: %1$@ legfeljebb %2$ld bájtot fogad el. Az ezen túli rész lemaradhat.

# section-picker-label
source: Section
de: Bereich
hu: Rész

source: Show inline media
de: Eingebettete Medien anzeigen
hu: Beágyazott média megjelenítése

source: Show notifications for channel
de: Benachrichtigungen für diesen Kanal anzeigen
hu: Csatornaértesítések megjelenítése

source: Show unread count in channel list
de: Anzahl ungelesener Nachrichten in der Kanalliste anzeigen
hu: Olvasatlan üzenetek számának megjelenítése a csatornalistában

# this-channels-configuration-has-changed-do
source: Reload the channel’s settings?
de: Kanaleinstellungen neu laden?
hu: Újratöltöd a csatorna beállításait?

# topic-label
source: Topic
de: Thema
hu: Téma

# user-limit-field-hint
source: Enter a maximum from 0 through 99999.
de: Gib ein Maximum zwischen 0 und 99999 ein.
hu: Adj meg egy felső határt 0 és 99999 között.

# user-limit-mode
source: Limit number of users (+l)
de: Benutzeranzahl begrenzen (+l)
hu: Felhasználók számának korlátozása (+l)

# window-title
source: Invite to Channel
de: In Kanal einladen
hu: Meghívás csatornára

# you-will-loose-unsaved-changes-if
source: Your unsaved changes will be discarded.
de: Deine ungesicherten Änderungen werden verworfen.
hu: A nem mentett módosítások elvesznek.

# cancel-button
source: Cancel
de: Abbrechen
hu: Mégse

# change-topic-button
source: Change Topic
de: Thema ändern
hu: Téma módosítása

# editor-accessibility-hint
source: Edit the topic. IRC text formatting is preserved.
de: Bearbeite das Thema. Die IRC-Textformatierung bleibt erhalten.
hu: Szerkeszd a témát. Az IRC-szövegformázás megmarad.

# topic-editor-heading
source: Topic for %@
de: Thema für %@
hu: %@ témája

# characters-remaining
source: %lld bytes remaining
de: %lld Byte übrig
hu: %lld bájt maradt

# characters-over-limit
source: %lld bytes too many
de: %lld Byte zu viel
hu: %lld bájttal több

# access-list
source: Channel Access List
de: Kanalzugriffsliste
hu: Csatorna-hozzáférési lista

source: Added By
de: Hinzugefügt von
hu: Hozzáadta

# ban-exceptions
source: Ban Exceptions in %@
de: Bann-Ausnahmen in %@
hu: Kitiltási kivételek itt: %@

# entry-count-truncated
source: First %ld entries
de: Erste %ld Einträge
hu: Első %ld bejegyzés

# entry-count
source: %ld entries
de: %ld Einträge
hu: %ld bejegyzés

source: Created
de: Erstellt
hu: Létrehozva

# empty-description
source: The server reported no entries for this list.
de: Der Server hat keine Einträge für diese Liste gemeldet.
hu: A kiszolgáló nem küldött bejegyzést ehhez a listához.

# empty-title
source: No Entries
de: Keine Einträge
hu: Nincsenek bejegyzések

# heading-for-the-ban-bans
source: Bans in %@
de: Banns in %@
hu: Kitiltások itt: %@

# heading-for-the-quiet-quiets
source: Quiets in %@
de: Stummschaltungen in %@
hu: Némítások itt: %@

# invite-exceptions
source: Invite Exceptions in %@
de: Einladungs-Ausnahmen in %@
hu: Meghívási kivételek itt: %@

source: Hostmask
de: Hostmaske
hu: Címmaszk

# list-truncated-notice
source: The server sent more entries than this window keeps.
de: Der Server hat mehr Einträge gesendet, als dieses Fenster speichert.
hu: A kiszolgáló több bejegyzést küldött, mint amennyit ez az ablak megőriz.

source: Loading List
de: Liste wird geladen
hu: Lista betöltése

# of-entries
source: %1$ld of %2$ld entries
de: %1$ld von %2$ld Einträgen
hu: %1$ld / %2$ld bejegyzés

source: Remove Selected
de: Ausgewählte entfernen
hu: Kijelöltek eltávolítása

source: Update List
de: Liste aktualisieren
hu: Lista frissítése

# name-label
source: Name
hu: Név

source: Optional
hu: Nem kötelező
